{"modelTopology": {"backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, null, null, 3]}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [2, 2], "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 32, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_1"}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 32, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_2"}, "name": "conv2d_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_3"}, "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "gamma_constraint": null}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [3, 3], "name": "max_pooling2d_1", "trainable": true}, "name": "max_pooling2d_1", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 80, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_4"}, "name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "gamma_constraint": null}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 192, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_5"}, "name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "gamma_constraint": null}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [3, 3], "name": "max_pooling2d_2", "trainable": true}, "name": "max_pooling2d_2", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_9"}, "name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_9", "gamma_constraint": null}, "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 48, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_7"}, "name": "conv2d_7", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 96, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_10"}, "name": "conv2d_10", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_7", "gamma_constraint": null}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_10", "gamma_constraint": null}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "padding": "same", "strides": [1, 1], "pool_size": [3, 3], "name": "average_pooling2d_1", "trainable": true}, "name": "average_pooling2d_1", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_6"}, "name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [5, 5], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_8"}, "name": "conv2d_8", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 96, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_11"}, "name": "conv2d_11", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 32, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_12"}, "name": "conv2d_12", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6", "gamma_constraint": null}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_8", "gamma_constraint": null}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_11", "gamma_constraint": null}, "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_12", "gamma_constraint": null}, "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "mixed0", "trainable": true, "axis": 3}, "name": "mixed0", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_16"}, "name": "conv2d_16", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_16", "gamma_constraint": null}, "name": "batch_normalization_16", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_16", "trainable": true, "activation": "relu"}, "name": "activation_16", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 48, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_14"}, "name": "conv2d_14", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 96, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_17"}, "name": "conv2d_17", "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_14", "gamma_constraint": null}, "name": "batch_normalization_14", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_17", "gamma_constraint": null}, "name": "batch_normalization_17", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_14", "trainable": true, "activation": "relu"}, "name": "activation_14", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_17", "trainable": true, "activation": "relu"}, "name": "activation_17", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "padding": "same", "strides": [1, 1], "pool_size": [3, 3], "name": "average_pooling2d_2", "trainable": true}, "name": "average_pooling2d_2", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_13"}, "name": "conv2d_13", "inbound_nodes": [[["mixed0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [5, 5], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_15"}, "name": "conv2d_15", "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 96, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_18"}, "name": "conv2d_18", "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_19"}, "name": "conv2d_19", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_13", "gamma_constraint": null}, "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_15", "gamma_constraint": null}, "name": "batch_normalization_15", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_18", "gamma_constraint": null}, "name": "batch_normalization_18", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_19", "gamma_constraint": null}, "name": "batch_normalization_19", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}, "name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "activation": "relu"}, "name": "activation_15", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_18", "trainable": true, "activation": "relu"}, "name": "activation_18", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_19", "trainable": true, "activation": "relu"}, "name": "activation_19", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "mixed1", "trainable": true, "axis": 3}, "name": "mixed1", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_23"}, "name": "conv2d_23", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_23", "gamma_constraint": null}, "name": "batch_normalization_23", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_23", "trainable": true, "activation": "relu"}, "name": "activation_23", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 48, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_21"}, "name": "conv2d_21", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 96, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_24"}, "name": "conv2d_24", "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_21", "gamma_constraint": null}, "name": "batch_normalization_21", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_24", "gamma_constraint": null}, "name": "batch_normalization_24", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_21", "trainable": true, "activation": "relu"}, "name": "activation_21", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_24", "trainable": true, "activation": "relu"}, "name": "activation_24", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"data_format": "channels_last", "padding": "same", "strides": [1, 1], "pool_size": [3, 3], "name": "average_pooling2d_3", "trainable": true}, "name": "average_pooling2d_3", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_20"}, "name": "conv2d_20", "inbound_nodes": [[["mixed1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [5, 5], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_22"}, "name": "conv2d_22", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 96, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_25"}, "name": "conv2d_25", "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_26"}, "name": "conv2d_26", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_20", "gamma_constraint": null}, "name": "batch_normalization_20", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_22", "gamma_constraint": null}, "name": "batch_normalization_22", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_25", "gamma_constraint": null}, "name": "batch_normalization_25", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_26", "gamma_constraint": null}, "name": "batch_normalization_26", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_20", "trainable": true, "activation": "relu"}, "name": "activation_20", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_22", "trainable": true, "activation": "relu"}, "name": "activation_22", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_25", "trainable": true, "activation": "relu"}, "name": "activation_25", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_26", "trainable": true, "activation": "relu"}, "name": "activation_26", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "mixed2", "trainable": true, "axis": 3}, "name": "mixed2", "inbound_nodes": [[["activation_20", 0, 0, {}], ["activation_22", 0, 0, {}], ["activation_25", 0, 0, {}], ["activation_26", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 64, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_28"}, "name": "conv2d_28", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_28", "gamma_constraint": null}, "name": "batch_normalization_28", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_28", "trainable": true, "activation": "relu"}, "name": "activation_28", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 96, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_29"}, "name": "conv2d_29", "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_29", "gamma_constraint": null}, "name": "batch_normalization_29", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_29", "trainable": true, "activation": "relu"}, "name": "activation_29", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [2, 2], "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 384, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_27"}, "name": "conv2d_27", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "strides": [2, 2], "activity_regularizer": null, "padding": "valid", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 96, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_30"}, "name": "conv2d_30", "inbound_nodes": [[["activation_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_27", "gamma_constraint": null}, "name": "batch_normalization_27", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_30", "gamma_constraint": null}, "name": "batch_normalization_30", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_27", "trainable": true, "activation": "relu"}, "name": "activation_27", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_30", "trainable": true, "activation": "relu"}, "name": "activation_30", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "pool_size": [3, 3], "name": "max_pooling2d_3", "trainable": true}, "name": "max_pooling2d_3", "inbound_nodes": [[["mixed2", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "mixed3", "trainable": true, "axis": 3}, "name": "mixed3", "inbound_nodes": [[["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}], ["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 128, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_35"}, "name": "conv2d_35", "inbound_nodes": [[["mixed3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_35", "gamma_constraint": null}, "name": "batch_normalization_35", "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_35", "trainable": true, "activation": "relu"}, "name": "activation_35", "inbound_nodes": [[["batch_normalization_35", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [7, 1], "strides": [1, 1], "activity_regularizer": null, "padding": "same", "bias_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "filters": 128, "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "name": "conv2d_36"}, "name": "conv2d_36", "inbound_nodes": [[["activation_35", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "trainable": true, "center": true, "beta_regularizer": null, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": false, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 3, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_36", "gamma_constraint": null}, "name": "batch_normalization_36", "inbound_nodes": [[["conv2d_36", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_36", "trainable": true, "activation": "relu"}, "name": "activation_36", "inbound_nodes": [[["batch_normalization_36", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"kernel_size": [1, 1], "strides": [1, 1], 